#1-Сформувати список з 30 випадкових цілих чисел від -100 до + 100.
#Знайти максимальний елемент списку і його порядковий номер. Отримати
#інший список, що складається тільки з непарних чисел вихідного списку
#або повідомити, що таких чисел немає. Отриманий список вивести в
#порядку зменшення елементів.

import random # підключаємо модуль 
lis = random.sample(range(-100 , 100),30)  #Формуємо рандомний список 
print (type(lis))
print ("\n Список :  ",lis)
print( "\n Максимальний елемент з списку - ", max(lis)) 
print ("\n Індекс максимального елемента - [" , lis.index(max(lis)) ,"]") 
lis1 = [ i for i in lis if (i % 2) == 1 ]
if len(lis1)==0:
    print("Всі елементи списку парні ")
else: 
    print ("\nНовий список з не парних елементів  : ",lis1)
print ("Сортований список : ",sorted(lis1,reverse=True))
print()